#+TITLE: Napredne tehnike programiranja - kolokvijumi Python
#+LANGUAGE: sr
#+SETUPFILE: ../org-html-themes/setup/theme-bigblow.setup
#+PROPERTY: header-args:python :session ntp :results output :exports both
#+TAGS: za_radoznale

*** Šta su dekoratori i čemu služe? Dati jedan prost primer.
    Dekoratori su funkcije višeg reda koje kao parametre prihvataju
    druge funkcije (ili =callable= generalno) i vraćaju izmenjenu verziju.

    #+BEGIN_SRC python
      def dekorator(f):
          def w(a):
              return str(f(a)) + " dekorisano."
          return w

      @dekorator
      def inc(n):
          return n + 1
    #+END_SRC

    #+RESULTS:

    #+BEGIN_SRC python
      inc(43)
    #+END_SRC

    #+RESULTS:
    : '44 dekorisano.'

*** Šta radi specijalna metoda =__next__=?
    Vraća sledeći element iterabilnog objekta ako postoji ili
    =StopIteration= izuzetak.

    #+BEGIN_SRC python
      class Iterabilno():
          def __init__(self, a):
              self.a = a
          def __iter__(self):
              return self
          def __next__(self):
              if self.a < 10:
                  self.a += 1
                  return self.a
              else:
                  raise StopIteration
    #+END_SRC

    #+RESULTS:

    #+BEGIN_SRC python
      a = Iterabilno(1)

      [i for i in a]
    #+END_SRC

    #+RESULTS:
    :
    : >>> [2, 3, 4, 5, 6, 7, 8, 9, 10]

    #+BEGIN_SRC python
      a = Iterabilno(1)

      a.__next__()
      a.__next__()
      a.__next__()
      a.__next__()
      a.__next__()
      a.__next__()
      a.__next__()
      a.__next__()
      a.__next__()
      a.__next__()
    #+END_SRC

    #+RESULTS:
    #+begin_example

    >>> 2
    3
    4
    5
    6
    7
    8
    9
    10
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
      File "<stdin>", line 11, in __next__
    StopIteration
    #+end_example

    #+BEGIN_SRC python
      li = [1, 2, 3]
    #+END_SRC

    #+RESULTS:

    #+BEGIN_SRC python
      [i for i in li]
    #+END_SRC

    #+RESULTS:
    : [1, 2, 3]

    Može i sa generatorima:

    #+BEGIN_SRC python
      def g(a):
          while a < 10:
              yield a + 1
              a += 1
    #+END_SRC

    #+RESULTS:

    #+BEGIN_SRC python
      gen = g(0)
      gen.__next__()
    #+END_SRC

    #+RESULTS:
    :
    : 1

    #+BEGIN_SRC python
      [i for i in gen]
    #+END_SRC

    #+RESULTS:
    : [2, 3, 4, 5, 6, 7, 8, 9, 10]

*** Šta su deskriptori i čemu služe? Dati jedan prost primer.
    Deskriptor je atribut objekta koji ima preklopljenu barem jednu
    metodu iz deskriptor protokola (=__set__=, =__get__=,
    =__del__=). Ako je neka od tih metoda atributa preklopljena ona će
    se koristiti kada se radi odgovarajuća =set=, =get= ili =del=
    akcija nad atributom.

    #+BEGIN_SRC python
      class Desc:
          def __init__(self, i):
              self.i = i
          def __set__(self, instance, v):
              print("instance.a: %s, value: %s" % (instance.a, v))
              self.i = v
          def __get__(self, instance, o):
              print("instance.a: %s, owner: %s" % (instance.a, o))
              return self.i

      class A:
          b = Desc(0)
          def __init__(self, a, b):
              self.a = a
              self.b = b
    #+END_SRC

    #+RESULTS:

    #+BEGIN_SRC python
      a = A(43, 23)
      a.b = 21230
      a.b
    #+END_SRC

    #+RESULTS:
    : instance.a: 43, value: 23
    : instance.a: 43, value: 21230
    : instance.a: 43, owner: <class '__main__.A'>
    : 21230

*** Koristeći dekoratore dopuniti klasu =Counter= da radi kao što je dato u primeru dole.

    #+BEGIN_SRC python
    def prettify(f):
        def wrapper(param):
            return "This is " + str(f(param))
        return wrapper
    #+END_SRC

    #+RESULTS:

    #+BEGIN_SRC python
    class Counter():
        def __init__(self, num):
            self.num = num
        @prettify
        def two_up(self):
            return self.num + 2
    #+END_SRC

    #+RESULTS:

    #+BEGIN_SRC python
    Counter(1).two_up()
    #+END_SRC

    #+RESULTS:
    : 'This is 3'

